{"/academy":{"title":"Kara-Okey! Academy","data":{"":"¿Te preguntas cómo se hacen las cosas por aquí? ¡Pues ya no!En la Academia encontrarás los recursos necesarios para sacarle el mayor provecho a las herramientas que ofrece Kara-Okey!\nSi tienes alguna pregunta que no se responde aquí, contacta al administrador."}},"/academy/assets-download":{"title":"Descarga de Medios (Música y Videos)","data":{"":"Conseguir la música para Kara-Okey! solía ser una tarea un tanto complicada, pero ahora no hay qué temer más.La herramienta YouTube Downloader integrada en Sync-Okey! te ayudará a descargar todos los medios que necesites para expandir el catálogo de canciones.Tendrás la posibilidad de descargar tanto archivos .mp3 (música) como .mp4 (video) siempre y cuando el enlace pertenezca a YouTube, ya que como su nombre indica, YouTube Downloader sólo funciona con dicha plataforma.\nYouTube Downloader sigue en fase BETA. Se espera que presente errores. Por favor, reporta cualquier error que llegues a encontrar al utilizar esta herramienta. Tus comentarios ayudan a perfeccionar Kara-Okey! ¡Gracias!","cómo-se-utiliza-youtube-downloader#¿Cómo Se Utiliza YouTube Downloader?":"Al abrir Sync-Okey! encontrarás un botón de flecha hacia abajo ubicado en la esquina superior derecha.Al dar clic en ese botón se abrirá la Bandeja de Descargas. ¡Sólo ingresa el enlace de YouTube que desees y listo!\r\nPuedes elegir si quieres un archivo .mp3 o .mp4.\nLa descarga puede tomar desde unos pocos segundos, hasta posibles HORAS. Este es un problema conocido de YouTube Downloader y se tratará de resolver lo antes posible.Mientras Tanto: Puedes intentar descargar un .mp3 de corta duración antes de descargar archivos más grandes. Esto parece ayudar un poco a disminuir el tiempo de espera.","alternativas-a-youtube-downloader#Alternativas a YouTube Downloader":"Mientras YouTube Downloader aún se encuentre en fase beta es de esperarse que presente errores y quieras utilizar una herramienta más confiable.En todo caso, puedes hacer uso de cualquier herramienta para descargar los archivos que necesites. ¡La procedencia no importa!Recomendados:\nhttps://es.ytmp3.mobi/es1/\nhttps://y2meta.app/es6\nhttps://deturl.com/"}},"/academy/video-url":{"title":"Asignación de Videos como Fondos de Pantalla","data":{"":"La función de los Fondos Personalizados te permite ajustar el aspecto visual de cada canción a tu antojo.\r\nEntre los parámetros que puedes modificar, el más destacable sería, sin duda, la opción de establecer un video para mostrar en el fondo.Hay dos formas distintas de asignar un video:\nTomando un archivo .mp4 de tu dispositivo.\nMediante un enlace web.\nTomar un archivo de tu dispositivo, si bien sería la mejor opción, procura no hacerlo.","por-qué-evitar-los-archivos-locales#¿Por Qué Evitar los Archivos Locales?":"Utilizar archivos .mp4 tiene muchas ventajas por encima de utilizar enlaces. Por ejemplo:\nMenos latencia.\nNo necesita conexión a internet.\nMenor probabilidad de congelamiento o pérdida de fotogramas.\nEl archivo siempre se incluirá junto a la canción. No hay peligro de que se elimine el enlace.\nEs más fácil de conseguir que un enlace compatible.\nEn general es muchísimo mejor que usar enlaces web. Pero entonces... ¿Por qué evitarlo?La respuesta es simple: espacio de almacenamiento.Actualmente (02/Ene/2024) transferimos los archivos de Kara-Okey! mediante la plataforma GitHub, la cual tiene un límite de 100MB por archivo individual y 5GB de espacio total.\r\nEste es un problema bastante importante, dada la cantidad de canciones habidas y por haber en el catálogo de Kara-Okey!Los archivos .mp4 pueden alcanzar fácilmente 1GB de espacio cada uno, y con nuestros limitados 5GB (compartidos por todas las canciones y aplicaciones), no podemos darnos ese lujo. Al menos por ahora.Aún así es completamente posible asignar los videos de tu dispositivo. Pero sería mejor que los convirtieras a un enlace compatible.","cómo-consigo-un-enlace-compatible#¿Cómo Consigo un Enlace Compatible?":"No basta con copiar y pegar un enlace de YouTube. Para poder reproducir un video desde una URL, es necesario que sea una URL Directa, la cual no es ofrececida por plataformas como YouTube.Al acceder a una URL Directa no verás la interfaz del sitio web, sino un simple recuadro que contiene un reproductor de video sencillo. Ese reproductor es brindado por tu navegador (ej: Google Chrome), no por la página web.Para poder conseguir los enlaces necesarios, sigue estos pasos:","descarga-el-video#Descarga el Video":"Puedes hacer esto utilizando la herramienta YouTube Downloader integrada en Sync-Okey! o mediante cualquier otro método. Más información","sube-el-video#Sube el Video":"Ya que has descargado el video de YouTube (o cualquier otra plataforma), necesitamos guardarlo en otra plataforma que sí nos permita acceder a una URL Directa. Por ejemplo, Dropbox.Dropbox te da acceso a 2GB de almacenamiento gratuito.","enlace-para-compartir#Enlace Para Compartir":"Ahora debes tomar un enlace para compartir el archivo de Dropbox.\r\nLos enlaces para compartir lucen algo así: https://www.dropbox.com/scl/fi/cgs9y9beugzvaq2fkahqg/Overwatch-2-2024.01.02-01.49.33.08.DVR.mp4?rlkey=r9yat0sgh91q7hszwo1f566np&dl=0Si accedes a ese enlace verás esto:\r\nEste enlace aún no es compatible con Kara-Okey!","convertir-a-enlace-directo#Convertir a Enlace Directo":"El enlace que conseguiste en el paso anterior debería terminar en &dl=0. Sólo reemplaza eso por &raw=1 y accede a ese enlace desde tu navegador.Ahora deberías ver esto:","copiar-pegar-y-listo#Copiar, Pegar Y... ¡Listo!":"Después de acceder al enlace modificado deberías poder ver el video sin la interfaz de Dropbox. Si este es el caso, ya puedes copiar el enlace que muestra tu navegador e ingresarlo a Sync-Okey!El enlace final debería lucir algo así: https://ucf48a9c7a3426b68274623c1772.dl.dropboxusercontent.com/cd/0/inline//file#Nota que ahora es mucho más largo y no empieza con https://www.dropbox.com"}},"/changelogs":{"title":"Lista de Cambios","data":{"":"Aquí puedes encontrar todos los cambios que han llegado a Kara-Okey! con el paso del tiempo.\r\n¡Incluyendo las versiones beta!","faq#FAQ":"","qué-significan-los-números-de-versión#¿Qué significan los números de versión?":"Las distintas versiones de Kara-Okey! se enumeran con un formato estándar de 3 dígitos bastante sencillo\r\n0.0.0Cada número representa la importancia de la actualización.\r\nDe izquierda a derecha:\nCambio Mayor: Este sólo cambia cuando se han hecho modificaciones importantes que pueden llegar a cambiar la experiencia en su totalidad.\nCambio Menor: Cuando la actualización presenta herramientas u opciones nuevas al programa, pero no significa un cambio total en el modo de empleo.\nParche: Representa que se arreglaron errores o ajustaron cosas generalmente pequeñas.","aún-pueden-descargarse-las-versiones-anteriores#¿Aún pueden descargarse las versiones anteriores?":"No. Pero a futuro estaría bien comenzar a ofrecer esas versiones en un posible Kara-Okey! Archive. ¡Hay que preservar la historia!"}},"/changelogs/0.1.0":{"title":"0.1.0 (beta)","data":{"":"Primera versión funcional de Kara-Okey!"}},"/changelogs/0.1.1":{"title":"0.1.1 (beta)","data":{"nuevo#Nuevo":"Sync-Okey!: Aplicación que permite agregar canciones nuevas al catálogo con facilidad."}},"/changelogs/0.1.2":{"title":"0.1.2 (beta)","data":{"nuevo#Nuevo":"Post-Editor: Herramienta de Sync-Okey! que permite ajustar los tiempos de las letras sin regrabar la canción completa."}},"/changelogs/1.0.0":{"title":"1.0.0","data":{"":"La primera versión estable de Kara-Okey!","cambios#Cambios":"Nueva Interfaz de Usuario."}},"/changelogs/0.1.3":{"title":"0.1.3 (beta)","data":{"removido#Removido":"Post-Editor: Aunque cumplía su función, la vista previa no funcionaba correctamente y hacía que el proceso de edición fuese más tardado y molesto. La herramienta será arreglada y reintroducida en futuras actualizaciones."}},"/changelogs/1.1.2":{"title":"1.1.2","data":{"":"14 de Mar. 2023","cambios#Cambios":"Soporte para imágenes de formato .JFIF\nLas letras que estén encapsuladas entre paréntesis tendrán un tono semitransparente."}},"/changelogs/1.2.0":{"title":"1.2.0","data":{"":"1 de Nov. de 2023\nAviso:\r\nSe han encontrado errores importantes en YouTube Downloader (BETA) que pueden provocar congelamientos de la aplicación y posible pérdida de datos no guardados.3 de Nov. 2023: Estos errores ya han sido corregidos en la actualización 1.2.1.","nuevo#Nuevo":"Youtube Downloader (BETA): Herramienta que permite descargar música y videos de YouTube.\nPara acceder a esta herramienta, da clic en el botón ubicado en la esquina superior derecha de la ventana.\nEsta función es experimental y podría presentar errores al utilizarse.\nNuevas transiciones de pantalla.","cambios#Cambios":"Caché de Carátulas: Si varias canciones pertenecen al mismo álbum, la portada sólo se cargará una vez y se reutilizará para el resto de canciones. Esto acelera el proceso de carga y mejora ligeramente el rendimiento de la aplicación.\nEl logo \"Kara-Okey!\" ahora adopta el color de la canción que esté sonando.\nLa pantalla de inicio de Unity (\"Made with Unity\") tiene un nuevo estilo.","arreglos#Arreglos":"Se arreglaron los bordes puntiagudos que se presentaban en algunas imágenes.\nAl decir \"Empezar\" ya no se reiniciará la canción que estaba sonando en la pantalla de título."}},"/changelogs/1.2.1":{"title":"1.2.1","data":{"":"3 de Nov. 2023\nAviso:\r\nSe ha notado un alto consumo de RAM al cargar las canciones del catálogo (≈5GB por 130 canciones). Esto puede suponer un problema a futuro, donde más canciones significará más memoria.31 de Dic. 2023: Estos errores ya han sido corregidos en la actualización 2.0.0","cambios#Cambios":"Para acelerar su uso, YouTube Downloader (BETA) ahora recuerda la carpeta en donde descargaste el archivo más reciente.\nSync-Okey!: Ya no es necesario dar clic en \"Empezar\" para entrar al menú principal, ahora también puedes pulsar la tecla Espacio o Enter","arreglos#Arreglos":"Importante: Ya no se permite ingresar enlaces que no pertenezcan a YouTube. Esto congelaba la aplicación.\nLos archivos descargados con YouTube Downloader (BETA) ya son totalmente compatibles.\nEn la Bandeja de Descargas, el nombre del archivo descargado ya no se sobrepone al porcentaje de descarga."}},"/changelogs/2.0.0":{"title":"2.0.0","data":{"":"31 de Dic. 2023\nAviso:\r\nLa función Fondos Personalizados sólo permite agregar imágenes o vídeos desde tu dispositivo. Pero los vídeos gastan bastante espacio de almacenamiento.2 de Ene. 2024: Esto ya ha sido resuelto en la actualización 2.1.0.\n¡Felíz año nuevo y versión nueva! 🍾\r\nEstos cambios han sido bastante complicados, pero hechos con cariño ❤️","nuevo#Nuevo":"Kara-Okey! Website: Este sitio servirá como un registro de todo lo relacionado a Kara-Okey! Por el momento empezamos con la Lista de Cambios.\r\n¡Toda la información será más accesible ahora!\nKara-Okey! Updater: Una nueva aplicación que se ejecuta automáticamente junto con Windows, encargada de darte avisos cuando se publique una nueva versión de Kara-Okey!A futuro te ayudará a actualizar la aplicación sin necesidad de GitHub Desktop, ¡Pero después!.\nFondos Personalizados: ¡Ahora puedes elegir cómo lucirá el fondo de cada canción! Admite colores sólidos, imágenes y vídeos1. También incluye algunos filtros que se sobreponen a tus imágenes.","arreglos#Arreglos":"Optimización de RAM: El consumo de memoria ha pasado de ≈5GB a ≈1.5GB por cada ≈130 canciones. ¡Ahora funciona en computadoras de 4GB de RAM o incluso menos!2\n1 Sólo se admiten los siguientes formatos: jpg, jpeg, jfif, mp4\r\n2 El consumo de RAM puede variar drásticamente entre dispositivos y aumentar en largas sesiones de juego."}},"/compatibility":{"title":"Lista de Compatibilidad","data":{"":"Plataforma\tKara-Okey!\tSync-Okey!\tWindows 7\t⛔ No Compatible\t✅ Compatible\tWindows 8\t⛔ No Compatible\t✅ Compatible\tWindows 10\t✅ Compatible\t✅ Compatible\tWindows 11\t✅ Compatible\t✅ Compatible\tMacOS\t⛔ No Compatible\t⛔ No Compatible\tGNU/Linux\t⛔ No Compatible\t⛔ No Compatible\tAndroid\t⛔ No Compatible\t⛔ No Compatible\tiOS\t⛔ No Compatible\t⛔ No Compatible","notas#Notas:":"Las plataformas que aparecen en la lista están consideradas para ofrecer soporte oficial.\nLa función Comandos de Voz de Kara-Okey! no puede transferirse a otras plataformas debido a que depende de una API de Microsoft; sólo disponible para Windows 10 y Windows 11."}},"/":{"title":"Kara-Okey!","data":{"":"¡Una plataforma de Karaoke que permite convertir cualquier computadora en una auténtica máquina de fiestas!La experiencia se divide en 2 (dos) aplicaciones:","kara-okey#Kara-Okey!":"La aplicación que se utiliza para cantar, jugar y celebrar con tus amigos.","sync-okey#Sync-Okey!":"Esta aplicación te permite añadir nuevas canciones y expandir tu catálogo.\nPara saber si tu equipo es, o será compatible con alguna de las aplicaciones Kara-Okey! visita la Lista de Compatibilidad"}},"/changelogs/2.1.0":{"title":"2.1.0","data":{"":"2 de Ene. 2024","nuevo#Nuevo":"Kara-Okey! Academy: Una serie de guías y tutoriales sobre cómo utilizar las diversas herramientas de Kara-Okey!\nFondos Personalizados: Ahora puedes (y se recomienda) usar enlaces de internet para abrir videos. Más información.","cambios#Cambios":"Kara-Okey! Updater ya no necesita la instalación de .NET\nKara-Okey! Updater ahora revisa actualizaciones cada hora (antes era cada día).\nLos Fondos Personalizados ya no admiten archivos de más de 100MB.\nAhora puedes consultar la versión de Kara-Okey! en la pantalla de título (esquina superior izquierda).","arreglos#Arreglos":"Algunos títulos de video provocaban que YouTube Downloader se congelara.\nA veces Kara-Okey! Updater no se registraba correctamente para iniciar junto con Windows.\nLos colores personalizados no se aplicaban correctamente al utilizar negro puro (#000000)."}}}